Keule/ZAI_GPS/ag-steer/src/hal_esp32/hal_impl.cpp
/// Read available characters from a serial and try to form a complete NMEA line.
static bool readNmeaLine(HardwareSerial& ser, char* buf, size_t max_len, size_t* pos) {
    // Limit reads per call to avoid blocking the scheduler
    int max_reads = 64;
    while (ser.available() > 0 && max_reads-- > 0) {
        int c = ser.read();
        if (c < 0) break;

        if (c == '\r') continue;  // skip CR
        if (c == '\n') {
            if (*pos > 0) {
                buf[*pos] = '\0';
                *pos = 0;
                return true;
            }
            continue;
        }

        if (*pos < max_len - 1) {
            buf[*pos++] = static_cast<char>(c);
        } else {
            // Buffer overflow – reset
            *pos = 0;
        }
    }
    return false;
}

bool hal_gnss_main_read_line(char* buf, size_t max_len) {
    bool result = readNmeaLine(gnssMainSerial, buf, max_len, &s_gnss_main_pos);
    if (result) s_gnss_main_has_data = true;
    return result;
}

bool hal_gnss_heading_read_line(char* buf, size_t max_len) {
    bool result = readNmeaLine(gnssHeadingSerial, buf, max_len, &s_gnss_heading_pos);
    if (result) s_gnss_heading_has_data = true;
    return result;
}

bool hal_gnss_main_detect(void) {
    return s_gnss_main_has_data;
}

bool hal_gnss_heading_detect(void) {
    return s_gnss_heading_has_data;
}

void hal_gnss_reset_detection(void) {
    s_gnss_main_has_data = false;
    s_gnss_heading_has_data = false;
}

// ===================================================================
// SPI Sensors / Actuator – SPI Bus 2 (FSPI / SPI2_HOST)
// ===================================================================
void hal_sensor_spi_init(void) {
    sensorSPI.begin(SENS_SPI_SCK, SENS_SPI_MISO, SENS_SPI_MOSI, -1);
    hal_log("ESP32: shared SPI initialised on FSPI/SPI2_HOST (SCK=%d MISO=%d MOSI=%d)",
            SENS_SPI_SCK, SENS_SPI_MISO, SENS_SPI_MOSI);
}

void hal_sensor_spi_deinit(void) {
    sensorSPI.end();
    hal_log("ESP32: shared SPI released (FSPI peripheral free)");
}

void hal_sensor_spi_reinit(void) {
    sensorSPI.begin(SENS_SPI_SCK, SENS_SPI_MISO, SENS_SPI_MOSI, -1);
    hal_log("ESP32: shared SPI re-initialised on FSPI/SPI2_HOST");
}

void hal_imu_begin(void) {
    pinMode(CS_IMU, OUTPUT);
    digitalWrite(CS_IMU, HIGH);
    // TODO: Send BNO085 reset/initialise sequence over SPI
    hal_log("ESP32: IMU begun on CS=%d (stub)", CS_IMU);
}

bool hal_imu_read(float* yaw_rate_dps, float* roll_deg) {
    // TODO: Implement BNO085 SH-2 SPI read protocol
    *yaw_rate_dps = 0.0f;
    *roll_deg = 0.0f;
    return true;
}

bool hal_imu_detect(void) {
    // BNO085 detection: read chip ID from register 0x00
    // Expected chip ID: 0x00 (BNO085 responds to SPI reset)
    // For now, verify SPI bus is responsive by attempting a transfer
    sensorSPI.beginTransaction(SPISettings(1000000, MSBFIRST, SPI_MODE0));
    digitalWrite(CS_IMU, LOW);
    uint8_t response = sensorSPI.transfer(0x00);
    digitalWrite(CS_IMU, HIGH);
    sensorSPI.endTransaction();

    // 0xFF = floating MISO (no device pulling it down)
    // 0x00 = MISO stuck LOW (bus fault)
    // A real BNO085 would respond with its chip ID.
    // For now: detect as OK if response is NOT 0xFF (floating) and NOT 0x00 (fault).
    // TODO: When real BNO085 is connected, check actual chip ID.
    bool detected = (response != 0xFF && response != 0x00);
    hal_log("ESP32: IMU detect: SPI response=0x%02X %s",
            response, detected ? "OK" : "FAIL (no device)");
    return detected;
}

// ===================================================================
// ADS1118 – 16-Bit ADC for steering angle potentiometer
// ===================================================================
// Connected via SPI Bus 2 (FSPI / SPI2_HOST), CS = GPIO 39.
//
// ADS1118 SPI protocol (NOT standard SPI slave!):
//   The ADS1118 uses a fixed 16-bit frame per CS cycle.
//   Config and data are transmitted SIMULTANEOUSLY:
//     - While DIN receives config (16 bits), DOUT outputs the
//       previous conversion result (16 bits).
//     - CS HIGH → starts new conversion (if OS bit = 1)
//
//   IMPORTANT: Only 16 bits per CS cycle! Sending more bytes
//   overwrites the config register with garbage.
//
// SPI Mode: TI datasheet says Mode 1 (CPOL=0, CPHA=1) only.
//   We try both Mode 0 and Mode 1 during detection and use
//   whichever returns valid data.
//
// Timing (single-shot mode, 128 SPS):
//   Conversion time = 1/128 = 7.8 ms
//   Must wait >= 8 ms after CS HIGH before next CS LOW.
//   Control loop at 200 Hz (5 ms) → read every other cycle.
//
// Config register (16 bit, MSB first):
//   Bit 15    : OS  = 1 (start single-shot conversion)
//   Bits 14-12: MUX = 000 (AIN0 vs GND)
//   Bits 11-9 : PGA = 001 (±4.096V range)
//   Bit 8     : MODE = 1 (single-shot, not continuous)
//   Bits 7-5  : DR  = 100 (128 SPS)
//   Bit 4     : CM  = 0 (standard mode)
//   Bit 3     : TS  = 0 (ADC mode, not temp sensor)
//   Bit 2     : POL = 0 (MSB first)
//   Bits 1-0  : CQ  = 11 (comparator disabled)
//
// Config = 0x8383  (1000 0011 1000 0011)
//
// ADC result: 16-bit signed, MSB first.
//   0xFFFF = conversion not ready / busy
//   ±4.096V → 1 LSB = 0.125 mV
//   0-3.3V poti → raw 0 to ~26880
// ===================================================================

/// ADS1118 config: AIN0, ±4.096V, single-shot, 128 SPS
static const uint16_t ADS1118_CONFIG =
    (1u << 15) |  // OS: start single-shot
    (0u << 12) |  // MUX: AIN0 vs GND
    (1u <<  9) |  // PGA: ±4.096V
    (1u <<  8) |  // MODE: single-shot
    (4u <<  5) |  // DR: 128 SPS
    (0u <<  4) |  // CM: standard
    (0u <<  3) |  // TS: ADC mode
    (0u <<  2) |  // POL: MSB first
    (3u <<  0);   // CQ: comparator disabled
// = 0x8383

/// 1 LSB in volts (±4.096V over 32768 steps)
static const float ADS1118_LSB_V = 0.000125f;  // 4.096 / 32768 = 125 µV = 0.000125 V

/// Minimum time between CS HIGH and next CS LOW (ms)
/// 128 SPS = 7.8125 ms, use 9 ms for safety margin
static const uint32_t ADS1118_CONV_MS = 9;

/// Timestamp of last CS HIGH (start of conversion)
static uint32_t s_ads_last_conv_start = 0;

/// Last valid raw ADC reading
static int16_t s_ads_last_raw = 0;

/// SPI mode that worked during detection (SPI_MODE0 or SPI_MODE1)
static uint8_t s_ads_spi_mode = SPI_MODE0;

