Keule/ZAI_GPS/ag-steer/src/hal_esp32/hal_impl.cpp
/// Whether ADS1118 was detected successfully
static bool s_ads_detected = false;

/// Whether DOUT data must be bit-inverted (some cheap modules use
/// transistor level-shifters that invert the signal on DOUT).
/// Detected automatically during hal_steer_angle_detect().
static bool s_ads_invert_dout = false;

/**
 * Perform one ADS1118 SPI transaction (16 bits).
 *
 * Sends config to DIN while reading previous conversion result from DOUT.
 * CS HIGH starts a new conversion.
 *
 * If s_ads_invert_dout is true, the received bytes are bit-inverted
 * before interpretation (compensates for modules with inverting level
 * shifters on the DOUT line).
 *
 * @return 16-bit raw ADC value (0xFFFF = conversion not ready)
 */
static int16_t ads1118Transaction(void) {
    sensorSPI.beginTransaction(SPISettings(1000000, MSBFIRST, s_ads_spi_mode));
    digitalWrite(CS_STEER_ANG, LOW);

    // 16-bit simultaneous transfer: config OUT, result IN
    uint8_t msb = sensorSPI.transfer(static_cast<uint8_t>((ADS1118_CONFIG >> 8) & 0xFF));
    uint8_t lsb = sensorSPI.transfer(static_cast<uint8_t>(ADS1118_CONFIG & 0xFF));

    digitalWrite(CS_STEER_ANG, HIGH);
    sensorSPI.endTransaction();

    s_ads_last_conv_start = millis();

    // Apply bit inversion if the module's DOUT line is inverted
    if (s_ads_invert_dout) {
        msb = ~msb;
        lsb = ~lsb;
    }

    return static_cast<int16_t>((static_cast<uint16_t>(msb) << 8) | lsb);
}

/**
 * DOUT connectivity test.
 *
 * Sends a distinctive 0x55 0x55 pattern (01010101) on MOSI.
 * If DOUT is correctly on MISO, the ADS1118 drives its own data
 * (previous conversion result) which will NOT be 0x55.
 * If DIN/DOUT are swapped, MISO picks up the MOSI signal and
 * reads back approximately 0x55 0x55 (crosstalk).
 * If DOUT is not connected at all, MISO reads 0xFF 0xFF (floating).
 *
 * @return true if DOUT appears to be correctly connected (device responds)
 */
static bool ads1118CheckDoutConnection(void) {
    // Use slow clock for reliable bit-bang-level test
    sensorSPI.beginTransaction(SPISettings(200000, MSBFIRST, SPI_MODE0));
    digitalWrite(CS_STEER_ANG, LOW);
    uint8_t b1 = sensorSPI.transfer(0x55);  // distinctive pattern
    uint8_t b2 = sensorSPI.transfer(0x55);
    digitalWrite(CS_STEER_ANG, HIGH);
    sensorSPI.endTransaction();

    bool crosstalk  = (b1 == 0x55 || b2 == 0x55);
    bool floating   = (b1 == 0xFF && b2 == 0xFF);

    if (crosstalk) {
        hal_log("ESP32: ADS1118 DOUT test: CROSSTALK (read 0x%02X 0x%02X)", b1, b2);
        hal_log("ESP32:   DIN/DOUT cables are SWAPPED!");
        hal_log("ESP32:   Correct: DOUT -> GPIO%d (MISO)  DIN -> GPIO%d (MOSI)",
                SENS_SPI_MISO, SENS_SPI_MOSI);
        return false;
    } else if (floating) {
        hal_log("ESP32: ADS1118 DOUT test: FLOATING (read 0xFF 0xFF)");
        hal_log("ESP32:   No device driving MISO – check wiring");
        hal_log("ESP32:   DOUT must be connected to GPIO%d (MISO)", SENS_SPI_MISO);
        return false;
    } else {
        hal_log("ESP32: ADS1118 DOUT test: OK (read 0x%02X 0x%02X)", b1, b2);
        return true;
    }
}

/**
 * Check if a raw ADC value looks like MOSI→MISO crosstalk.
 *
 * Crosstalk patterns to detect:
 *   - Low byte matches config low byte  (0x83)
 *   - High byte matches config high byte (0x83)
 *   - Entire value matches config word     (0x8383)
 *   - Value is close to 0x5555 or 0x0000 (test pattern echo)
 */
static bool ads1118IsCrosstalk(int16_t raw) {
    uint16_t uval = static_cast<uint16_t>(raw);
    uint16_t lo = uval & 0x00FF;
    uint16_t hi = (uval >> 8) & 0x00FF;

    // Config word bytes appear in the reading
    if (lo == 0x83 || hi == 0x83) return true;

    // Continuous-mode config echo (0x03 in high byte)
    if (hi == 0x03) return true;

    // Test pattern echo
    if (uval == 0x5555 || uval == 0x0000) return true;

    return false;
}

void hal_steer_angle_begin(void) {
    pinMode(CS_STEER_ANG, OUTPUT);
    digitalWrite(CS_STEER_ANG, HIGH);
    hal_delay_ms(1);

    hal_log("ESP32: ADS1118 on CS=%d (AIN0, +/-4.096V, 128 SPS)", CS_STEER_ANG);

    // === DOUT CONNECTIVITY TEST ===
    // Before attempting full detection, verify DOUT is on the correct pin.
    // This prevents false-positive detection with crosstalk data.
    ads1118CheckDoutConnection();
}

bool hal_steer_angle_detect(void) {
    // === ADS1118 DETECTION ===
    // Strategy: try both SPI modes, pick the one that returns valid data.
    // Use slow clock (200 kHz) for reliable detection.
    // Full cycle per mode: send config → wait → read result.

    struct ModeResult {
        uint8_t mode;
        const char* name;
        int16_t raw;
        bool valid;
        bool inverted;
    };

    ModeResult results[2] = {
        { SPI_MODE0, "Mode0", 0, false, false },
        { SPI_MODE1, "Mode1", 0, false, false },
    };

    for (int i = 0; i < 2; i++) {
        uint8_t mode = results[i].mode;

        // Step 1: send config, start conversion (ignore garbage result)
        sensorSPI.beginTransaction(SPISettings(200000, MSBFIRST, mode));
        digitalWrite(CS_STEER_ANG, LOW);
        sensorSPI.transfer(static_cast<uint8_t>((ADS1118_CONFIG >> 8) & 0xFF));
        sensorSPI.transfer(static_cast<uint8_t>(ADS1118_CONFIG & 0xFF));
        digitalWrite(CS_STEER_ANG, HIGH);
        sensorSPI.endTransaction();

        // Step 2: wait for conversion to complete
        hal_delay_ms(ADS1118_CONV_MS + 3);

        // Step 3: read conversion result
        sensorSPI.beginTransaction(SPISettings(200000, MSBFIRST, mode));
        digitalWrite(CS_STEER_ANG, LOW);
        uint8_t msb = sensorSPI.transfer(static_cast<uint8_t>((ADS1118_CONFIG >> 8) & 0xFF));
        uint8_t lsb = sensorSPI.transfer(static_cast<uint8_t>(ADS1118_CONFIG & 0xFF));
        digitalWrite(CS_STEER_ANG, HIGH);
        sensorSPI.endTransaction();

        int16_t raw = static_cast<int16_t>((static_cast<uint16_t>(msb) << 8) | lsb);
        int16_t raw_inv = static_cast<int16_t>(~raw);  // bit-inverted

        // Choose: inverted or not?
        // Some cheap modules have inverting level-shifters on DOUT.
        // Heuristic: prefer the interpretation that gives a value within
        // the ±4.096V range (0..32768 for unipolar poti on 0-3.3V)
        // and does NOT look like crosstalk.
        bool raw_crosstalk = ads1118IsCrosstalk(raw);
        bool inv_crosstalk = ads1118IsCrosstalk(raw_inv);
        bool raw_ok = (raw != static_cast<int16_t>(0xFFFF)) && !raw_crosstalk;
        bool inv_ok = (raw_inv != static_cast<int16_t>(0xFFFF)) && !inv_crosstalk;

        // Prefer inverted if raw is crosstalk but inverted is clean,
        // OR if inverted gives a positive value while raw is negative
        // (assuming poti input is 0-3.3V → positive ADC reading).
        bool use_inverted = false;
        if (inv_ok && !raw_ok) {
            use_inverted = true;
        } else if (raw_ok && inv_ok) {
            // Both pass crosstalk check — prefer the one with
            // a value in the expected 0-3.3V range
            if (raw < 0 && raw_inv >= 0) use_inverted = true;
        }

        results[i].raw = use_inverted ? raw_inv : raw;
        results[i].inverted = use_inverted;
        results[i].valid = (results[i].raw != static_cast<int16_t>(0xFFFF));

        float voltage = static_cast<float>(results[i].raw) * ADS1118_LSB_V;
        hal_log("ESP32: ADS1118 %s%s: raw=%d (0x%04X), voltage=%.4fV %s",
                results[i].name,
                use_inverted ? " (inv)" : "",
                results[i].raw,
                static_cast<uint16_t>(results[i].raw),
                voltage,
                results[i].valid ? "OK" : "BAD");
    }

