Keule/ZAI_GPS/ag-steer/src/hal_esp32/hal_impl.cpp
    // Pick the best result
    int16_t best_raw = 0;
    uint8_t best_mode = SPI_MODE0;
    bool any_valid = false;

    for (int i = 0; i < 2; i++) {
        if (results[i].valid) {
            any_valid = true;
            best_raw = results[i].raw;
            best_mode = results[i].mode;
            break;  // Mode0 preferred if both valid
        }
    }

    if (any_valid) {
        s_ads_spi_mode = best_mode;
        s_ads_last_raw = best_raw;
        s_ads_detected = true;

        // Store the inversion flag from the winning mode
        for (int i = 0; i < 2; i++) {
            if (results[i].mode == best_mode) {
                s_ads_invert_dout = results[i].inverted;
                break;
            }
        }

        float voltage = static_cast<float>(best_raw) * ADS1118_LSB_V;
        hal_log("ESP32: ADS1118 DETECTED OK (%s%s, raw=%d, %.4fV)",
                (best_mode == SPI_MODE0) ? "Mode0" : "Mode1",
                s_ads_invert_dout ? ", invert-DOUT" : "",
                best_raw, voltage);
        return true;
    }

    // === DETECTION FAILED ===
    s_ads_detected = false;

    // For failure diagnostics, re-evaluate raw vs inverted
    bool any_crosstalk = false;
    bool any_floating = false;
    for (int i = 0; i < 2; i++) {
        uint16_t u = static_cast<uint16_t>(results[i].raw);
        if (u == 0xFFFF) any_floating = true;
        if (!results[i].inverted && ads1118IsCrosstalk(results[i].raw)) any_crosstalk = true;
        if (results[i].inverted && ads1118IsCrosstalk(static_cast<int16_t>(~results[i].raw))) any_crosstalk = true;
    }

    if (any_crosstalk) {
        hal_log("ESP32: ADS1118 DETECT FAILED – crosstalk in both modes");
        hal_log("ESP32: ROOT CAUSE: DIN/DOUT cables are SWAPPED");
        hal_log("ESP32: ACTION: Swap the two data cables on the ADS1118 module:");
        hal_log("ESP32:   DOUT -> GPIO%d (MISO)  DIN -> GPIO%d (MOSI)",
                SENS_SPI_MISO, SENS_SPI_MOSI);
    } else if (any_floating) {
        hal_log("ESP32: ADS1118 DETECT FAILED – no response (0xFFFF)");
        hal_log("ESP32: ROOT CAUSE: ADS1118 not communicating");
        hal_log("ESP32: Check: (1) DOUT connected to GPIO%d?", SENS_SPI_MISO);
        hal_log("ESP32:        (2) DIN connected to GPIO%d?", SENS_SPI_MOSI);
        hal_log("ESP32:        (3) ADS1118 powered (VDD=3.3V)?");
        hal_log("ESP32:        (4) CS jumper to GPIO%d?", CS_STEER_ANG);
    } else {
        hal_log("ESP32: ADS1118 DETECT FAILED – unknown response");
    }

    return false;
}

float hal_steer_angle_read_deg(void) {
    if (!s_ads_detected) {
        return 0.0f;  // Not detected – return neutral
    }

    // Check if enough time has passed for the conversion to complete
    uint32_t elapsed = millis() - s_ads_last_conv_start;
    if (elapsed >= ADS1118_CONV_MS) {
        // Conversion ready – read result and start next conversion
        int16_t raw = ads1118Transaction();

        // 0xFFFF means conversion not ready or bus error
        if (raw != static_cast<int16_t>(0xFFFF)) {
            s_ads_last_raw = raw;
        }
        // else: keep previous value
    }
    // else: not enough time, return last known value

    int16_t raw = s_ads_last_raw;

    // Convert to voltage
    float voltage = static_cast<float>(raw) * ADS1118_LSB_V;

    // Normalise to 0.0 .. 1.0 (3.3V poti supply)
    float normalised = voltage / 3.3f;

    // Clamp
    if (normalised < 0.0f) normalised = 0.0f;
    if (normalised > 1.0f) normalised = 1.0f;

    // Map 0..1 → -45°..+45°
    float angle = (normalised * 90.0f) - 45.0f;

    return angle;
}

void hal_actuator_begin(void) {
    pinMode(CS_ACT, OUTPUT);
    digitalWrite(CS_ACT, HIGH);
    hal_log("ESP32: Actuator begun on CS=%d (stub)", CS_ACT);
}

bool hal_actuator_detect(void) {
    // Actuator is write-only, hard to verify by reading back.
    // Just verify the SPI bus works by attempting a transfer.
    sensorSPI.beginTransaction(SPISettings(1000000, MSBFIRST, SPI_MODE0));
    digitalWrite(CS_ACT, LOW);
    uint8_t response = sensorSPI.transfer(0x00);
    digitalWrite(CS_ACT, HIGH);
    sensorSPI.endTransaction();

    bool detected = true;  // Stub: assume OK (actuator is write-only)
    hal_log("ESP32: Actuator detect: SPI %s", detected ? "OK" : "FAIL");
    return detected;
}

void hal_actuator_write(uint16_t cmd) {
    sensorSPI.beginTransaction(SPISettings(1000000, MSBFIRST, SPI_MODE0));
    digitalWrite(CS_ACT, LOW);
    sensorSPI.transfer(static_cast<uint8_t>((cmd >> 8) & 0xFF));
    sensorSPI.transfer(static_cast<uint8_t>(cmd & 0xFF));
    digitalWrite(CS_ACT, HIGH);
    sensorSPI.endTransaction();
}

// ===================================================================
// Network – W5500 Ethernet via ESP-IDF ETH driver
//
// Uses ETH.begin() to initialise the W5500 on SPI3_HOST with the
// pins defined by the LilyGO board design.  The ETH driver handles
// SPI communication internally – no manual SPI setup needed.
//
// Link status and IP assignment are tracked via WiFi.onEvent()
// callbacks (ARDUINO_EVENT_ETH_CONNECTED / ARDUINO_EVENT_ETH_GOT_IP).
// ===================================================================

/// WiFi event handler for Ethernet events
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
static void onEthEvent(WiFiEvent_t event, arduino_event_info_t info) {
#else
// Arduino 2.x uses older event signature
static void onEthEvent(WiFiEvent_t event) {
#endif
    switch (event) {
    case ARDUINO_EVENT_ETH_START:
        hal_log("ETH: driver started");
        ETH.setHostname("agsteer");
        break;

    case ARDUINO_EVENT_ETH_CONNECTED:
        hal_log("ETH: link UP (%s %u Mbps)",
                ETH.fullDuplex() ? "full-duplex" : "half-duplex",
                ETH.linkSpeed());
        s_eth_link_up = true;
        break;

    case ARDUINO_EVENT_ETH_GOT_IP:
        hal_log("ETH: got IP %s  (MAC: %s)",
                ETH.localIP().toString().c_str(),
                ETH.macAddress().c_str());
        s_eth_has_ip = true;
        // Start UDP listener on AgIO port
        ethUDP.begin(AOG_PORT_AGIO);
        hal_log("ETH: UDP listening on port %u", AOG_PORT_AGIO);
        break;

